{
    "id": "177",
    "identity": {
        "error": null,
        "id": "177"
    },
    "interpretation": {
        "global_hyperparameters": {
            "id": "177",
            "learning_rate": 0.00016453210474399993
        },
        "model": {
            "backend": "tensorflow",
            "class_name": "Model",
            "config": {
                "input_layers": [
                    [
                        "input_task_00_term_00",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                100,
                                116
                            ],
                            "dtype": "float32",
                            "name": "input_task_00_term_00",
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_00_term_00"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_1",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            100,
                                            116
                                        ],
                                        "dtype": "float32",
                                        "name": "input_1",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_1"
                                },
                                {
                                    "class_name": "LSTM",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.1358163078833676,
                                        "go_backwards": 0,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_3_LSTM_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.11192633852843373,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
                                        "return_sequences": true,
                                        "return_state": false,
                                        "stateful": false,
                                        "trainable": true,
                                        "unit_forget_bias": true,
                                        "units": 91,
                                        "unroll": false,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_1",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_LSTM_0"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 116,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "normal",
                                                "mode": "fan_in",
                                                "scale": 2.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 1.0347677061872673e-06
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_LSTM_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_1_module_189_1_3",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_1_module_189_1_3"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_2",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            50,
                                            116
                                        ],
                                        "dtype": "float32",
                                        "name": "input_2",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_2"
                                },
                                {
                                    "class_name": "LSTM",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.1358163078833676,
                                        "go_backwards": 0,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_3_LSTM_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.11192633852843373,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
                                        "return_sequences": true,
                                        "return_state": false,
                                        "stateful": false,
                                        "trainable": true,
                                        "unit_forget_bias": true,
                                        "units": 91,
                                        "unroll": false,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_2",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_LSTM_0"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 116,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "normal",
                                                "mode": "fan_in",
                                                "scale": 2.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 1.0347677061872673e-06
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_LSTM_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_2_module_189_1_4",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_1_module_189_1_3",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_2_module_189_1_4"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "final_maxpool_task_00_node_02",
                            "padding": "valid",
                            "pool_size": [
                                4
                            ],
                            "strides": [
                                4
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_2_module_189_1_4",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "final_maxpool_task_00_node_02"
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "data_format": "channels_last",
                            "name": "flattendec_task_00_term_00",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "final_maxpool_task_00_node_02",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "flattendec_task_00_term_00"
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "softmax",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "densedec_task_00_term_00",
                            "trainable": true,
                            "units": 339,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "flattendec_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "densedec_task_00_term_00"
                    }
                ],
                "name": "model_1",
                "output_layers": [
                    [
                        "densedec_task_00_term_00",
                        0,
                        0
                    ]
                ]
            },
            "keras_version": "2.2.4"
        }
    },
    "metrics": {
        "alt_objective": null,
        "avg_gpu_batch_time": [],
        "execution": {
            "client_elapsed_time": 59.957783460617065,
            "eval_error": null,
            "queue_wait_time": 140.9421525001526,
            "return_timestamp": 1568750996.5949714
        },
        "fitness": 0.10754842955604166,
        "loss_history": {
            "activation_1_acc": [
                0.13253313325351104,
                0.1850462615057718,
                0.19554888715473345,
                0.19554888719199567,
                0.19554888716963834
            ],
            "activation_1_loss": [
                2.484625056315196,
                2.4609366500040806,
                2.4836295866077918,
                2.484393243939914,
                2.484340187369898
            ],
            "activation_2_acc": [
                0.005251312828207052,
                0.022505626399149208,
                0.023505876461664837,
                0.021255313821004672,
                0.024256064008551556
            ],
            "activation_2_loss": [
                5.393569310863902,
                5.393065239733891,
                5.393627685676607,
                5.393628113029539,
                5.393628113029539
            ],
            "activation_3_acc": [
                0.09827456862725566,
                0.12678169540149864,
                0.12678169540149864,
                0.1267816953791413,
                0.12678169539404618
            ],
            "activation_3_loss": [
                4.6724812634499795,
                4.637771963685654,
                4.563332650565481,
                4.5624632629104545,
                4.562516698362709
            ],
            "loss": [
                12.55115301724105,
                12.492251866935163,
                12.441069519975896,
                12.440964276208136,
                12.440963836692816
            ],
            "val_activation_1_acc": [
                0.14629258591689184,
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557
            ],
            "val_activation_1_loss": [
                2.4833286157351937,
                2.479674321616102,
                2.484473532330775,
                2.484402967598252,
                2.4843477777584284
            ],
            "val_activation_2_acc": [
                0.006012024048096192,
                0.014028055929319414,
                0.012024048004739867,
                0.012024048004739867,
                0.012024048004739867
            ],
            "val_activation_2_loss": [
                5.393308461787466,
                5.393626347811284,
                5.393628120422363,
                5.393628120422363,
                5.393628120422363
            ],
            "val_activation_3_acc": [
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953
            ],
            "val_activation_3_loss": [
                4.6709035030586685,
                4.57162872536149,
                4.566920697091815,
                4.566985954980334,
                4.567036638278999
            ],
            "val_loss": [
                12.548017234267117,
                12.445408903286308,
                12.44550180339622,
                12.445496673813325,
                12.445491274755321
            ]
        },
        "novelty": {
            "behavior": null
        },
        "num_epochs_trained": 5,
        "regression": {
            "features": null
        },
        "task_fitness": [
            0.10754842955604166
        ],
        "total_num_epochs_trained": 5,
        "train_seed": 277778,
        "training_time": 53.860217332839966,
        "weights_l2norm": null
    }
}