{
    "id": "186",
    "identity": {
        "error": null,
        "id": "186"
    },
    "interpretation": {
        "global_hyperparameters": {
            "id": "186",
            "learning_rate": 0.0007904896236021968
        },
        "model": {
            "backend": "tensorflow",
            "class_name": "Model",
            "config": {
                "input_layers": [
                    [
                        "input_task_00_term_00",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                100,
                                134
                            ],
                            "dtype": "float32",
                            "name": "input_task_00_term_00",
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_00_term_00"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_1",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            100,
                                            134
                                        ],
                                        "dtype": "float32",
                                        "name": "input_1",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_1"
                                },
                                {
                                    "class_name": "GRU",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.13943826597527592,
                                        "go_backwards": 1,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_3_GRU_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.4577925991924566,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
                                        "reset_after": true,
                                        "return_sequences": true,
                                        "return_state": false,
                                        "stateful": false,
                                        "trainable": true,
                                        "units": 141,
                                        "unroll": false,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_1",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_GRU_0"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 134,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 3.164164809277281e-05
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_GRU_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_1_module_127_1_4",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_1_module_127_1_4"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_2",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            50,
                                            134
                                        ],
                                        "dtype": "float32",
                                        "name": "input_2",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_2"
                                },
                                {
                                    "class_name": "GRU",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.13943826597527592,
                                        "go_backwards": 1,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_3_GRU_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.4577925991924566,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
                                        "reset_after": true,
                                        "return_sequences": true,
                                        "return_state": false,
                                        "stateful": false,
                                        "trainable": true,
                                        "units": 141,
                                        "unroll": false,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_2",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_GRU_0"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 134,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 3.164164809277281e-05
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_GRU_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_2_module_127_1_3",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_1_module_127_1_4",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_2_module_127_1_3"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "final_maxpool_task_00_node_02",
                            "padding": "valid",
                            "pool_size": [
                                4
                            ],
                            "strides": [
                                4
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_2_module_127_1_3",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "final_maxpool_task_00_node_02"
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "data_format": "channels_last",
                            "name": "flattendec_task_00_term_00",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "final_maxpool_task_00_node_02",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "flattendec_task_00_term_00"
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "softmax",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "densedec_task_00_term_00",
                            "trainable": true,
                            "units": 339,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "flattendec_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "densedec_task_00_term_00"
                    }
                ],
                "name": "model_1",
                "output_layers": [
                    [
                        "densedec_task_00_term_00",
                        0,
                        0
                    ]
                ]
            },
            "keras_version": "2.2.4"
        }
    },
    "metrics": {
        "alt_objective": null,
        "avg_gpu_batch_time": [],
        "execution": {
            "client_elapsed_time": 99.46777057647705,
            "eval_error": null,
            "queue_wait_time": 439.92069482803345,
            "return_timestamp": 1568751303.2384903
        },
        "fitness": 0.10554442157049376,
        "loss_history": {
            "activation_1_acc": [
                0.18604651157573987,
                0.19554888716963834,
                0.19554888719944813,
                0.1955488871621859,
                0.19554888719944813
            ],
            "activation_1_loss": [
                2.4771199901272696,
                2.4849066734313965,
                2.4849066734313965,
                2.4849066734313965,
                2.4849066734313965
            ],
            "activation_2_acc": [
                0.011502875718929733,
                0.0067516879145280515,
                0.006751687921980495,
                0.006751687921980495,
                0.006751687921980495
            ],
            "activation_2_loss": [
                5.393433480120862,
                5.3936285972595215,
                5.3936285972595215,
                5.3936285972595215,
                5.3936285972595215
            ],
            "activation_3_acc": [
                0.11052763184835744,
                0.1267816953791413,
                0.12678169538659376,
                0.12678169539404618,
                0.12678169539404618
            ],
            "activation_3_loss": [
                4.627428646473981,
                4.561977648204432,
                4.56197763270335,
                4.561977632464871,
                4.561977632464871
            ],
            "loss": [
                12.505813428836335,
                12.447937773418117,
                12.447530282619864,
                12.447072809175957,
                12.446616333047876
            ],
            "val_activation_1_acc": [
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557
            ],
            "val_activation_1_loss": [
                2.484906728377562,
                2.484906728377562,
                2.484906728377562,
                2.484906728377562,
                2.484906728377562
            ],
            "val_activation_2_acc": [
                0.006012024048096192,
                0.006012024048096192,
                0.006012024048096192,
                0.006012024048096192,
                0.006012024048096192
            ],
            "val_activation_2_loss": [
                5.3936285972595215,
                5.3936285972595215,
                5.3936285972595215,
                5.3936285972595215,
                5.3936285972595215
            ],
            "val_activation_3_acc": [
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953
            ],
            "val_activation_3_loss": [
                4.566514865668838,
                4.566514865668838,
                4.566514865668838,
                4.566514865668838,
                4.566514865668838
            ],
            "val_loss": [
                12.452611233285051,
                12.452276493599992,
                12.451828266671281,
                12.45136668830214,
                12.45091846137343
            ]
        },
        "novelty": {
            "behavior": null
        },
        "num_epochs_trained": 5,
        "regression": {
            "features": null
        },
        "task_fitness": [
            0.10554442157049376
        ],
        "total_num_epochs_trained": 5,
        "train_seed": 45329,
        "training_time": 93.40030455589294,
        "weights_l2norm": null
    }
}