{
    "id": "30",
    "identity": {
        "error": null,
        "id": "30"
    },
    "interpretation": {
        "global_hyperparameters": {
            "id": "30",
            "learning_rate": 0.00048773101663224277
        },
        "model": {
            "backend": "tensorflow",
            "class_name": "Model",
            "config": {
                "input_layers": [
                    [
                        "input_task_00_term_00",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                100,
                                180
                            ],
                            "dtype": "float32",
                            "name": "input_task_00_term_00",
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_00_term_00"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_1",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            100,
                                            180
                                        ],
                                        "dtype": "float32",
                                        "name": "input_1",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_1"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 180,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_in",
                                                "scale": 2.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 7.569979061372578e-05
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_1",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_1_module_17_1_3",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_1_module_17_1_3"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "final_maxpool_task_00_node_02",
                            "padding": "valid",
                            "pool_size": [
                                8
                            ],
                            "strides": [
                                8
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_1_module_17_1_3",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "final_maxpool_task_00_node_02"
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "data_format": "channels_last",
                            "name": "flattendec_task_00_term_00",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "final_maxpool_task_00_node_02",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "flattendec_task_00_term_00"
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "softmax",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "densedec_task_00_term_00",
                            "trainable": true,
                            "units": 339,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "flattendec_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "densedec_task_00_term_00"
                    }
                ],
                "name": "model_1",
                "output_layers": [
                    [
                        "densedec_task_00_term_00",
                        0,
                        0
                    ]
                ]
            },
            "keras_version": "2.2.4"
        }
    },
    "metrics": {
        "alt_objective": null,
        "avg_gpu_batch_time": [],
        "execution": {
            "client_elapsed_time": 40.16300296783447,
            "eval_error": null,
            "queue_wait_time": 14.69795036315918,
            "return_timestamp": 1568722454.43753
        },
        "fitness": 0.10821643219756817,
        "loss_history": {
            "activation_1_acc": [
                0.174293573370991,
                0.19554888718454325,
                0.1955488871621859,
                0.19554888719944813,
                0.1955488871770908
            ],
            "activation_1_loss": [
                2.4843588735080115,
                2.4669813954791415,
                2.479634561071279,
                2.4589321532825377,
                2.4327689813178432
            ],
            "activation_2_acc": [
                0.014003500875218804,
                0.02675668916484063,
                0.026756689157388186,
                0.026756689172293072,
                0.026756689172293072
            ],
            "activation_2_loss": [
                5.393374163200033,
                5.392807365149431,
                5.3936262167701425,
                5.393626671428828,
                5.393626312042183
            ],
            "activation_3_acc": [
                0.09227306822980455,
                0.12678169538659376,
                0.12678169538659376,
                0.12678169539404618,
                0.12678169540149864
            ],
            "activation_3_loss": [
                4.6718820974689095,
                4.639785597639759,
                4.567461720643326,
                4.582169621966726,
                4.585504644064344
            ],
            "loss": [
                12.574169914672959,
                12.52043596235744,
                12.460694686983132,
                12.45252535753949,
                12.428397015053857
            ],
            "val_activation_1_acc": [
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557
            ],
            "val_activation_1_loss": [
                2.482919434029497,
                2.463705931493419,
                2.480807752074125,
                2.458282351732732,
                2.427987330423328
            ],
            "val_activation_2_acc": [
                0.014028055929319414,
                0.014028055929319414,
                0.014028055929319414,
                0.014028055929319414,
                0.014028055929319414
            ],
            "val_activation_2_loss": [
                5.392702589054146,
                5.393620115482736,
                5.3936273014856,
                5.393626837071054,
                5.3936270692783275
            ],
            "val_activation_3_acc": [
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953
            ],
            "val_activation_3_loss": [
                4.669161358911671,
                4.58851194763948,
                4.569576073266222,
                4.585985561172087,
                4.597789457661356
            ],
            "val_loss": [
                12.566463260230178,
                12.46651169771183,
                12.462853781445949,
                12.454776821251144,
                12.435676224962743
            ]
        },
        "novelty": {
            "behavior": null
        },
        "num_epochs_trained": 5,
        "regression": {
            "features": null
        },
        "task_fitness": [
            0.10821643219756817
        ],
        "total_num_epochs_trained": 5,
        "train_seed": 239580,
        "training_time": 27.64728021621704,
        "weights_l2norm": null
    }
}