{
    "id": "409",
    "identity": {
        "error": null,
        "id": "409"
    },
    "interpretation": {
        "global_hyperparameters": {
            "id": "409",
            "learning_rate": 0.00011339292425691085
        },
        "model": {
            "backend": "tensorflow",
            "class_name": "Model",
            "config": {
                "input_layers": [
                    [
                        "input_task_00_term_00",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                100,
                                104
                            ],
                            "dtype": "float32",
                            "name": "input_task_00_term_00",
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_00_term_00"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "maxpool_task_00_node_04_block_00",
                            "padding": "valid",
                            "pool_size": [
                                2
                            ],
                            "strides": [
                                2
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "maxpool_task_00_node_04_block_00"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_1",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            100,
                                            104
                                        ],
                                        "dtype": "float32",
                                        "name": "input_1",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_1"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "elu",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 183,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_in",
                                                "scale": 2.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 7.600920798722655e-05,
                                                "l2": 0.0
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "layer_3_Conv1D_0",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_1",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_Conv1D_0"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 104,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 2.32606858219242e-08
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_Conv1D_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_1_module_369_1_5",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_1_module_369_1_5"
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "add_softmod_task_00_node_04",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "maxpool_task_00_node_04_block_00",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "model_1_module_369_1_5",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "add_softmod_task_00_node_04"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_2",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            50,
                                            104
                                        ],
                                        "dtype": "float32",
                                        "name": "input_2",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_2"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "elu",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 183,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_in",
                                                "scale": 2.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 7.600920798722655e-05,
                                                "l2": 0.0
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "layer_3_Conv1D_0",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_2",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_Conv1D_0"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 104,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 2.32606858219242e-08
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_Conv1D_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_2_module_369_1_4",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "add_softmod_task_00_node_04",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_2_module_369_1_4"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "maxpool_task_00_node_03_block_01",
                            "padding": "valid",
                            "pool_size": [
                                2
                            ],
                            "strides": [
                                2
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_1_module_369_1_5",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "maxpool_task_00_node_03_block_01"
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "add_softmod_task_00_node_03",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_2_module_369_1_4",
                                    1,
                                    0,
                                    {}
                                ],
                                [
                                    "maxpool_task_00_node_03_block_01",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "add_softmod_task_00_node_03"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_3",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            25,
                                            104
                                        ],
                                        "dtype": "float32",
                                        "name": "input_3",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_3"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "elu",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 183,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_in",
                                                "scale": 2.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 7.600920798722655e-05,
                                                "l2": 0.0
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "layer_3_Conv1D_0",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_3",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_Conv1D_0"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 104,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 2.32606858219242e-08
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_Conv1D_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_3_module_369_1_3",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "add_softmod_task_00_node_03",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_3_module_369_1_3"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "maxpool_task_00_node_02_block_01",
                            "padding": "valid",
                            "pool_size": [
                                2
                            ],
                            "strides": [
                                2
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_2_module_369_1_4",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "maxpool_task_00_node_02_block_01"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "maxpool_task_00_node_02_block_02",
                            "padding": "valid",
                            "pool_size": [
                                4
                            ],
                            "strides": [
                                4
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_1_module_369_1_5",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "maxpool_task_00_node_02_block_02"
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "add_softmod_task_00_node_02",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_3_module_369_1_3",
                                    1,
                                    0,
                                    {}
                                ],
                                [
                                    "maxpool_task_00_node_02_block_01",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "maxpool_task_00_node_02_block_02",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "add_softmod_task_00_node_02"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "final_maxpool_task_00_node_02",
                            "padding": "valid",
                            "pool_size": [
                                2
                            ],
                            "strides": [
                                2
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "add_softmod_task_00_node_02",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "final_maxpool_task_00_node_02"
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "data_format": "channels_last",
                            "name": "flattendec_task_00_term_00",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "final_maxpool_task_00_node_02",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "flattendec_task_00_term_00"
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "softmax",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "densedec_task_00_term_00",
                            "trainable": true,
                            "units": 339,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "flattendec_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "densedec_task_00_term_00"
                    }
                ],
                "name": "model_1",
                "output_layers": [
                    [
                        "densedec_task_00_term_00",
                        0,
                        0
                    ]
                ]
            },
            "keras_version": "2.2.4"
        }
    },
    "metrics": {
        "alt_objective": null,
        "avg_gpu_batch_time": [],
        "execution": {
            "client_elapsed_time": 23.00117802619934,
            "eval_error": null,
            "queue_wait_time": 1308.9076952934265,
            "return_timestamp": 1568763480.5858006
        },
        "fitness": 0.10621242421202028,
        "loss_history": {
            "activation_1_acc": [
                0.1562890722308048,
                0.1957989496927197,
                0.1955488871621859,
                0.19554888719199567,
                0.19554888714728103
            ],
            "activation_1_loss": [
                2.48424847616676,
                2.4636401851703655,
                2.4805226994920115,
                2.482115081978846,
                2.4707011584491543
            ],
            "activation_2_acc": [
                0.00900225056264066,
                0.01700425106276569,
                0.010252563140785197,
                0.010252563133332752,
                0.010252563140785197
            ],
            "activation_2_loss": [
                5.393357221708801,
                5.39295303514523,
                5.393626994686026,
                5.393627540920341,
                5.393626830970743
            ],
            "activation_3_acc": [
                0.043010752665814715,
                0.0822705676121007,
                0.12678169539404618,
                0.12678169538659376,
                0.12678169538659376
            ],
            "activation_3_loss": [
                4.67143375380512,
                4.635918706200903,
                4.567080932606695,
                4.5643867751186145,
                4.5739096903628065
            ],
            "loss": [
                13.062817177673553,
                12.993216683906923,
                12.933501809500074,
                12.922968158783927,
                12.911149671477775
            ],
            "val_activation_1_acc": [
                0.19238476912100952,
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557
            ],
            "val_activation_1_loss": [
                2.482492158312597,
                2.460514420258975,
                2.483668728199655,
                2.4801221285649913,
                2.4532059509911854
            ],
            "val_activation_2_acc": [
                0.01202404791328735,
                0.008016031972675738,
                0.010020039988707803,
                0.008016031972675738,
                0.008016031972675738
            ],
            "val_activation_2_loss": [
                5.39268039367003,
                5.393621008955166,
                5.393627815590593,
                5.393627106546161,
                5.393626557084506
            ],
            "val_activation_3_acc": [
                0.06412825669966385,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953
            ],
            "val_activation_3_loss": [
                4.667326015556504,
                4.594759504398507,
                4.567591214227772,
                4.571037267635246,
                4.602203059530927
            ],
            "val_loss": [
                13.04827586539045,
                12.945156640184667,
                12.932329768408277,
                12.922415993256655,
                12.916720136134085
            ]
        },
        "novelty": {
            "behavior": null
        },
        "num_epochs_trained": 5,
        "regression": {
            "features": null
        },
        "task_fitness": [
            0.10621242421202028
        ],
        "total_num_epochs_trained": 5,
        "train_seed": 77515,
        "training_time": 18.960941553115845,
        "weights_l2norm": null
    }
}