{
    "id": "567",
    "identity": {
        "error": null,
        "id": "567"
    },
    "interpretation": {
        "global_hyperparameters": {
            "id": "567",
            "learning_rate": 0.00010000000000000009
        },
        "model": {
            "backend": "tensorflow",
            "class_name": "Model",
            "config": {
                "input_layers": [
                    [
                        "input_task_00_term_00",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                100,
                                118
                            ],
                            "dtype": "float32",
                            "name": "input_task_00_term_00",
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_00_term_00"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "maxpool_task_00_node_04_block_00",
                            "padding": "valid",
                            "pool_size": [
                                2
                            ],
                            "strides": [
                                2
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "maxpool_task_00_node_04_block_00"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_1",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            100,
                                            118
                                        ],
                                        "dtype": "float32",
                                        "name": "input_1",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_1"
                                },
                                {
                                    "class_name": "LSTM",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.30277390833029516,
                                        "go_backwards": 0,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_3_LSTM_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.4054615023655504,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
                                        "return_sequences": true,
                                        "return_state": false,
                                        "stateful": false,
                                        "trainable": true,
                                        "unit_forget_bias": true,
                                        "units": 75,
                                        "unroll": false,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_1",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_LSTM_0"
                                },
                                {
                                    "class_name": "LSTM",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.28405728053032253,
                                        "go_backwards": 1,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_4_LSTM_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.22695883195913918,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
                                        "return_sequences": true,
                                        "return_state": false,
                                        "stateful": false,
                                        "trainable": true,
                                        "unit_forget_bias": true,
                                        "units": 93,
                                        "unroll": false,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_1",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_4_LSTM_0"
                                },
                                {
                                    "class_name": "Concatenate",
                                    "config": {
                                        "axis": -1,
                                        "name": "merge_layer_3_layer_4",
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_LSTM_0",
                                                0,
                                                0,
                                                {}
                                            ],
                                            [
                                                "layer_4_LSTM_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "merge_layer_3_layer_4"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 118,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 0.0001660485431784764
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "merge_layer_3_layer_4",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_1_module_569_1_5",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_1_module_569_1_5"
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "add_softmod_task_00_node_04",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "maxpool_task_00_node_04_block_00",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "model_1_module_569_1_5",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "add_softmod_task_00_node_04"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_2",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            50,
                                            118
                                        ],
                                        "dtype": "float32",
                                        "name": "input_2",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_2"
                                },
                                {
                                    "class_name": "LSTM",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.30277390833029516,
                                        "go_backwards": 0,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_3_LSTM_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.4054615023655504,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
                                        "return_sequences": true,
                                        "return_state": false,
                                        "stateful": false,
                                        "trainable": true,
                                        "unit_forget_bias": true,
                                        "units": 75,
                                        "unroll": false,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_2",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_LSTM_0"
                                },
                                {
                                    "class_name": "LSTM",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.28405728053032253,
                                        "go_backwards": 1,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_4_LSTM_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.22695883195913918,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
                                        "return_sequences": true,
                                        "return_state": false,
                                        "stateful": false,
                                        "trainable": true,
                                        "unit_forget_bias": true,
                                        "units": 93,
                                        "unroll": false,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_2",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_4_LSTM_0"
                                },
                                {
                                    "class_name": "Concatenate",
                                    "config": {
                                        "axis": -1,
                                        "name": "merge_layer_3_layer_4",
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_LSTM_0",
                                                0,
                                                0,
                                                {}
                                            ],
                                            [
                                                "layer_4_LSTM_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "merge_layer_3_layer_4"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 118,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 0.0001660485431784764
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "merge_layer_3_layer_4",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_2_module_569_1_4",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "add_softmod_task_00_node_04",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_2_module_569_1_4"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_2",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            50,
                                            118
                                        ],
                                        "dtype": "float32",
                                        "name": "input_2",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_2"
                                },
                                {
                                    "class_name": "LSTM",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.30277390833029516,
                                        "go_backwards": 0,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_3_LSTM_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.4054615023655504,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
                                        "return_sequences": true,
                                        "return_state": false,
                                        "stateful": false,
                                        "trainable": true,
                                        "unit_forget_bias": true,
                                        "units": 75,
                                        "unroll": false,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_2",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_LSTM_0"
                                },
                                {
                                    "class_name": "LSTM",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.28405728053032253,
                                        "go_backwards": 1,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_4_LSTM_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.22695883195913918,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
                                        "return_sequences": true,
                                        "return_state": false,
                                        "stateful": false,
                                        "trainable": true,
                                        "unit_forget_bias": true,
                                        "units": 93,
                                        "unroll": false,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_2",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_4_LSTM_0"
                                },
                                {
                                    "class_name": "Concatenate",
                                    "config": {
                                        "axis": -1,
                                        "name": "merge_layer_3_layer_4",
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_LSTM_0",
                                                0,
                                                0,
                                                {}
                                            ],
                                            [
                                                "layer_4_LSTM_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "merge_layer_3_layer_4"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 118,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 0.0001660485431784764
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "merge_layer_3_layer_4",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_2_module_569_1_8",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_1_module_569_1_5",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_2_module_569_1_8"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_2",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            50,
                                            118
                                        ],
                                        "dtype": "float32",
                                        "name": "input_2",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_2"
                                },
                                {
                                    "class_name": "LSTM",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.30277390833029516,
                                        "go_backwards": 0,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_3_LSTM_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.4054615023655504,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
