{
    "id": "344",
    "identity": {
        "error": null,
        "id": "344"
    },
    "interpretation": {
        "global_hyperparameters": {
            "id": "344",
            "learning_rate": 0.00026129896989869947
        },
        "model": {
            "backend": "tensorflow",
            "class_name": "Model",
            "config": {
                "input_layers": [
                    [
                        "input_task_00_term_00",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                100,
                                118
                            ],
                            "dtype": "float32",
                            "name": "input_task_00_term_00",
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_00_term_00"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "maxpool_task_00_node_04_block_00",
                            "padding": "valid",
                            "pool_size": [
                                2
                            ],
                            "strides": [
                                2
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "maxpool_task_00_node_04_block_00"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_1",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            100,
                                            118
                                        ],
                                        "dtype": "float32",
                                        "name": "input_1",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_1"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 118,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "normal",
                                                "mode": "fan_in",
                                                "scale": 2.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 3.297000006341477e-08
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_1",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_1_module_267_1_5",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_1_module_267_1_5"
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "add_softmod_task_00_node_04",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "maxpool_task_00_node_04_block_00",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "model_1_module_267_1_5",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "add_softmod_task_00_node_04"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_2",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            50,
                                            118
                                        ],
                                        "dtype": "float32",
                                        "name": "input_2",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_2"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 118,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "normal",
                                                "mode": "fan_in",
                                                "scale": 2.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 3.297000006341477e-08
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_2",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_2_module_267_1_4",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "add_softmod_task_00_node_04",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_2_module_267_1_4"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_3",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            25,
                                            118
                                        ],
                                        "dtype": "float32",
                                        "name": "input_3",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_3"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 118,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "normal",
                                                "mode": "fan_in",
                                                "scale": 2.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 3.297000006341477e-08
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_3",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_3_module_267_1_3",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_2_module_267_1_4",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_3_module_267_1_3"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "maxpool_task_00_node_02_block_01",
                            "padding": "valid",
                            "pool_size": [
                                2
                            ],
                            "strides": [
                                2
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_2_module_267_1_4",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "maxpool_task_00_node_02_block_01"
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "add_softmod_task_00_node_02",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_3_module_267_1_3",
                                    1,
                                    0,
                                    {}
                                ],
                                [
                                    "maxpool_task_00_node_02_block_01",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "add_softmod_task_00_node_02"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "final_maxpool_task_00_node_02",
                            "padding": "valid",
                            "pool_size": [
                                2
                            ],
                            "strides": [
                                2
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "add_softmod_task_00_node_02",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "final_maxpool_task_00_node_02"
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "data_format": "channels_last",
                            "name": "flattendec_task_00_term_00",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "final_maxpool_task_00_node_02",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "flattendec_task_00_term_00"
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "softmax",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "densedec_task_00_term_00",
                            "trainable": true,
                            "units": 339,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "flattendec_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "densedec_task_00_term_00"
                    }
                ],
                "name": "model_1",
                "output_layers": [
                    [
                        "densedec_task_00_term_00",
                        0,
                        0
                    ]
                ]
            },
            "keras_version": "2.2.4"
        }
    },
    "metrics": {
        "alt_objective": null,
        "avg_gpu_batch_time": [],
        "execution": {
            "client_elapsed_time": 14.395529508590698,
            "eval_error": null,
            "queue_wait_time": 641.1964826583862,
            "return_timestamp": 1568758596.0792801
        },
        "fitness": 0.10754842955604166,
        "loss_history": {
            "activation_1_acc": [
                0.174043510803195,
                0.19554888718454325,
                0.19554888719199567,
                0.19554888719199567,
                0.19554888719944813
            ],
            "activation_1_loss": [
                2.481916370079439,
                2.440931155163516,
                2.475981928342937,
                2.467490288996047,
                2.443936248933354
            ],
            "activation_2_acc": [
                0.006251562890722681,
                0.025506376586696092,
                0.028757189289871886,
                0.02850712677424298,
                0.028257064266066518
            ],
            "activation_2_loss": [
                5.393082578649041,
                5.393393624928868,
                5.393622420077981,
                5.39362536576069,
                5.39362504941936
            ],
            "activation_3_acc": [
                0.05026256561905302,
                0.09052263063530709,
                0.12678169535678396,
                0.12678169536423642,
                0.12678169538659376
            ],
            "activation_3_loss": [
                4.669496281321688,
                4.641560185459382,
                4.570661015139725,
                4.574833418137135,
                4.587715661773148
            ],
            "loss": [
                12.544518108754255,
                12.475907777422337,
                12.440288127795194,
                12.435971995299088,
                12.425299884617761
            ],
            "val_activation_1_acc": [
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557
            ],
            "val_activation_1_loss": [
                2.466695399943717,
                2.4748024438808343,
                2.473530272443691,
                2.4475251252283314,
                2.460685955020851
            ],
            "val_activation_2_acc": [
                0.01603206406853242,
                0.012024048004739867,
                0.012024048004739867,
                0.012024048004739867,
                0.012024048004739867
            ],
            "val_activation_2_loss": [
                5.3924197223716845,
                5.393622949749291,
                5.393626592441169,
                5.3936267023335,
                5.393627179170658
            ],
            "val_activation_3_acc": [
                0.058116232345481675,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953
            ],
            "val_activation_3_loss": [
                4.656155335879278,
                4.576030898428632,
                4.575206856928273,
                4.602744169369012,
                4.5807062657419335
            ],
            "val_loss": [
                12.515293230274636,
                12.444478954246383,
                12.442386609996726,
                12.4439187690108,
                12.43504222074826
            ]
        },
        "novelty": {
            "behavior": null
        },
        "num_epochs_trained": 5,
        "regression": {
            "features": null
        },
        "task_fitness": [
            0.10754842955604166
        ],
        "total_num_epochs_trained": 5,
        "train_seed": 76325,
        "training_time": 10.616880893707275,
        "weights_l2norm": null
    }
}