{
    "id": "253",
    "identity": {
        "error": null,
        "id": "253"
    },
    "interpretation": {
        "global_hyperparameters": {
            "id": "253",
            "learning_rate": 0.00012476267884668044
        },
        "model": {
            "backend": "tensorflow",
            "class_name": "Model",
            "config": {
                "input_layers": [
                    [
                        "input_task_00_term_00",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                100,
                                116
                            ],
                            "dtype": "float32",
                            "name": "input_task_00_term_00",
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_00_term_00"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_1",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            100,
                                            116
                                        ],
                                        "dtype": "float32",
                                        "name": "input_1",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_1"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 116,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "normal",
                                                "mode": "fan_in",
                                                "scale": 2.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 0.00048752091242931783
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_1",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_1_module_227_1_3",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_1_module_227_1_3"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "maxpool_task_00_node_04_block_01",
                            "padding": "valid",
                            "pool_size": [
                                2
                            ],
                            "strides": [
                                2
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "maxpool_task_00_node_04_block_01"
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "add_softmod_task_00_node_04",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_1_module_227_1_3",
                                    1,
                                    0,
                                    {}
                                ],
                                [
                                    "maxpool_task_00_node_04_block_01",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "add_softmod_task_00_node_04"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_3",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            50,
                                            116
                                        ],
                                        "dtype": "float32",
                                        "name": "input_3",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_3"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 116,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "normal",
                                                "mode": "fan_in",
                                                "scale": 2.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 0.00048752091242931783
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_3",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_3_module_227_1_4",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "add_softmod_task_00_node_04",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_3_module_227_1_4"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "final_maxpool_task_00_node_02",
                            "padding": "valid",
                            "pool_size": [
                                4
                            ],
                            "strides": [
                                4
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_3_module_227_1_4",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "final_maxpool_task_00_node_02"
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "data_format": "channels_last",
                            "name": "flattendec_task_00_term_00",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "final_maxpool_task_00_node_02",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "flattendec_task_00_term_00"
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "softmax",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "densedec_task_00_term_00",
                            "trainable": true,
                            "units": 339,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "flattendec_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "densedec_task_00_term_00"
                    }
                ],
                "name": "model_1",
                "output_layers": [
                    [
                        "densedec_task_00_term_00",
                        0,
                        0
                    ]
                ]
            },
            "keras_version": "2.2.4"
        }
    },
    "metrics": {
        "alt_objective": null,
        "avg_gpu_batch_time": [],
        "execution": {
            "client_elapsed_time": 13.025712490081787,
            "eval_error": null,
            "queue_wait_time": 81.5652973651886,
            "return_timestamp": 1568753918.3255913
        },
        "fitness": 0.10955243758264988,
        "loss_history": {
            "activation_1_acc": [
                0.07926981741710137,
                0.19379844953042621,
                0.1965491372172491,
                0.19554888719944813,
                0.1955488871770908
            ],
            "activation_1_loss": [
                2.484827763141767,
                2.4844817631719827,
                2.4834662646345866,
                2.476303092179581,
                2.472762888447885
            ],
            "activation_2_acc": [
                0.01100275067276703,
                0.019504876219054765,
                0.019004751180344507,
                0.019004751180344507,
                0.019004751180344507
            ],
            "activation_2_loss": [
                5.393591012856936,
                5.393381983257884,
                5.392879032856168,
                5.392292188447426,
                5.39345380466382
            ],
            "activation_3_acc": [
                0.08727181794703617,
                0.1255313827935443,
                0.1267816953791413,
                0.12678169537168885,
                0.12678169540149864
            ],
            "activation_3_loss": [
                4.67259693014589,
                4.6719069818342644,
                4.669612733326306,
                4.651102788867459,
                4.586058524347121
            ],
            "loss": [
                12.77082251476985,
                12.758813276145421,
                12.744919581125902,
                12.710280542643138,
                12.637757007763904
            ],
            "val_activation_1_acc": [
                0.14629258597661593,
                0.1863727439082935,
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557
            ],
            "val_activation_1_loss": [
                2.4847027887562234,
                2.484203616220631,
                2.4822449321020583,
                2.468092437258703,
                2.477998276272852
            ],
            "val_activation_2_acc": [
                0.020040080100596547,
                0.018036072084564484,
                0.018036072084564484,
                0.018036072084564484,
                0.018036072084564484
            ],
            "val_activation_2_loss": [
                5.393498583164865,
                5.393178666521886,
                5.39239098122698,
                5.393031202480645,
                5.3936060655093145
            ],
            "val_activation_3_acc": [
                0.12024048072302748,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953
            ],
            "val_activation_3_loss": [
                4.67235488929825,
                4.671269163578928,
                4.66647554542832,
                4.616264805765095,
                4.573537591464056
            ],
            "val_loss": [
                12.764606554188088,
                12.752233201372839,
                12.735152527421175,
                12.665031490440597,
                12.627580667545418
            ]
        },
        "novelty": {
            "behavior": null
        },
        "num_epochs_trained": 5,
        "regression": {
            "features": null
        },
        "task_fitness": [
            0.10955243758264988
        ],
        "total_num_epochs_trained": 5,
        "train_seed": 670941,
        "training_time": 9.307105779647827,
        "weights_l2norm": null
    }
}