{
    "id": "148",
    "identity": {
        "error": null,
        "id": "148"
    },
    "interpretation": {
        "global_hyperparameters": {
            "id": "148",
            "learning_rate": 0.00025826924524631126
        },
        "model": {
            "backend": "tensorflow",
            "class_name": "Model",
            "config": {
                "input_layers": [
                    [
                        "input_task_00_term_00",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                100,
                                93
                            ],
                            "dtype": "float32",
                            "name": "input_task_00_term_00",
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_00_term_00"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_1",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            100,
                                            93
                                        ],
                                        "dtype": "float32",
                                        "name": "input_1",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_1"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 93,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "normal",
                                                "mode": "fan_in",
                                                "scale": 2.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 0.00089812814258039
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_1",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_1_module_88_1_3",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_1_module_88_1_3"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "final_maxpool_task_00_node_02",
                            "padding": "valid",
                            "pool_size": [
                                8
                            ],
                            "strides": [
                                8
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_1_module_88_1_3",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "final_maxpool_task_00_node_02"
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "data_format": "channels_last",
                            "name": "flattendec_task_00_term_00",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "final_maxpool_task_00_node_02",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "flattendec_task_00_term_00"
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "softmax",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "densedec_task_00_term_00",
                            "trainable": true,
                            "units": 339,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "flattendec_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "densedec_task_00_term_00"
                    }
                ],
                "name": "model_1",
                "output_layers": [
                    [
                        "densedec_task_00_term_00",
                        0,
                        0
                    ]
                ]
            },
            "keras_version": "2.2.4"
        }
    },
    "metrics": {
        "alt_objective": null,
        "avg_gpu_batch_time": [],
        "execution": {
            "client_elapsed_time": 9.226016521453857,
            "eval_error": null,
            "queue_wait_time": 268.24277544021606,
            "return_timestamp": 1568750194.0275633
        },
        "fitness": 0.10821643219756817,
        "loss_history": {
            "activation_1_acc": [
                0.12053013248841862,
                0.1400350087298307,
                0.2063015753342289,
                0.20455113773973144,
                0.19554888715473345
            ],
            "activation_1_loss": [
                2.4847731863924727,
                2.4843557343598635,
                2.482944656115945,
                2.4723222612231694,
                2.455005619817449
            ],
            "activation_2_acc": [
                0.009252313078269568,
                0.02175543885971493,
                0.02675668916484063,
                0.02675668916484063,
                0.026756689172293072
            ],
            "activation_2_loss": [
                5.39358155051897,
                5.393342667265098,
                5.392729908026705,
                5.392191444882514,
                5.393442410294727
            ],
            "activation_3_acc": [
                0.04326081517399118,
                0.1095273818007467,
                0.1275318829185756,
                0.12678169539404618,
                0.12678169540149864
            ],
            "activation_3_loss": [
                4.672633311425963,
                4.671876686756299,
                4.669190296980106,
                4.651391581315701,
                4.60718357792554
            ],
            "loss": [
                12.706951566087094,
                12.691379749110174,
                12.6739497927613,
                12.63457773494315,
                12.567429033867507
            ],
            "val_activation_1_acc": [
                0.14428857796058386,
                0.1523046076954725,
                0.20040080112541367,
                0.18837675192432557,
                0.18837675192432557
            ],
            "val_activation_1_loss": [
                2.484615274803911,
                2.483967269828659,
                2.4810179030011317,
                2.460646556708999,
                2.461872527976791
            ],
            "val_activation_2_acc": [
                0.010020039988707803,
                0.016032064036803996,
                0.014028055929319414,
                0.014028055929319414,
                0.014028055929319414
            ],
            "val_activation_2_loss": [
                5.393496586946782,
                5.393115525255222,
                5.392217192716732,
                5.393071449830202,
                5.3935981953072405
            ],
            "val_activation_3_acc": [
                0.0841683365538985,
                0.10821643268655919,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953
            ],
            "val_activation_3_loss": [
                4.672369002340313,
                4.671119812256348,
                4.665389786263506,
                4.628850669325712,
                4.591213147004764
            ],
            "val_loss": [
                12.698768227754949,
                12.683040112436176,
                12.661639454369555,
                12.597352977745041,
                12.55453274675266
            ]
        },
        "novelty": {
            "behavior": null
        },
        "num_epochs_trained": 5,
        "regression": {
            "features": null
        },
        "task_fitness": [
            0.10821643219756817
        ],
        "total_num_epochs_trained": 5,
        "train_seed": 249650,
        "training_time": 5.562203407287598,
        "weights_l2norm": null
    }
}