{
    "id": "62",
    "identity": {
        "error": null,
        "id": "62"
    },
    "interpretation": {
        "global_hyperparameters": {
            "id": "62",
            "learning_rate": 0.00016453210474399993
        },
        "model": {
            "backend": "tensorflow",
            "class_name": "Model",
            "config": {
                "input_layers": [
                    [
                        "input_task_00_term_00",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                100,
                                171
                            ],
                            "dtype": "float32",
                            "name": "input_task_00_term_00",
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_00_term_00"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "final_maxpool_task_00_node_02",
                            "padding": "valid",
                            "pool_size": [
                                16
                            ],
                            "strides": [
                                16
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "final_maxpool_task_00_node_02"
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "data_format": "channels_last",
                            "name": "flattendec_task_00_term_00",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "final_maxpool_task_00_node_02",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "flattendec_task_00_term_00"
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "softmax",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "densedec_task_00_term_00",
                            "trainable": true,
                            "units": 339,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "flattendec_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "densedec_task_00_term_00"
                    }
                ],
                "name": "model_1",
                "output_layers": [
                    [
                        "densedec_task_00_term_00",
                        0,
                        0
                    ]
                ]
            },
            "keras_version": "2.2.4"
        }
    },
    "metrics": {
        "alt_objective": null,
        "avg_gpu_batch_time": [],
        "execution": {
            "client_elapsed_time": 7.725767612457275,
            "eval_error": null,
            "queue_wait_time": 167.49078369140625,
            "return_timestamp": 1568748730.3528416
        },
        "fitness": 0.10821643219756817,
        "loss_history": {
            "activation_1_acc": [
                0.12978244558159308,
                0.18604651157573987,
                0.1942985746213036,
                0.1955488871621859,
                0.19554888718454325
            ],
            "activation_1_loss": [
                2.4848524597651602,
                2.484631568498986,
                2.4842593033154565,
                2.4834942026536564,
                2.481462759863111
            ],
            "activation_2_acc": [
                0.007001750430156959,
                0.0172543135783946,
                0.024256064016004,
                0.028757189282419444,
                0.026756689172293072
            ],
            "activation_2_loss": [
                5.393589579126005,
                5.393460085941094,
                5.393240830635363,
                5.392879294585991,
                5.392402934861141
            ],
            "activation_3_acc": [
                0.023505876469117278,
                0.1167791947688899,
                0.12678169540149864,
                0.12678169539404618,
                0.12678169538659376
            ],
            "activation_3_loss": [
                4.672690807923463,
                4.672287593993225,
                4.671564489222968,
                4.670061117889107,
                4.66626822659301
            ],
            "loss": [
                12.551132886819346,
                12.550379261847704,
                12.549064731860227,
                12.546434544598826,
                12.540133968953283
            ],
            "val_activation_1_acc": [
                0.1823647289811251,
                0.1823647290408492,
                0.19038075994035764,
                0.18837675192432557,
                0.18837675192432557
            ],
            "val_activation_1_loss": [
                2.484745835493466,
                2.4844755576942155,
                2.483984150246293,
                2.4829002735848893,
                2.4797238357559235
            ],
            "val_activation_2_acc": [
                0.01202404791328735,
                0.01603206412825651,
                0.020040079977415606,
                0.014028055929319414,
                0.014028055929319414
            ],
            "val_activation_2_loss": [
                5.393532563784796,
                5.393367564749861,
                5.393086739198001,
                5.3926408916771535,
                5.392211921707184
            ],
            "val_activation_3_acc": [
                0.12024048011085553,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953
            ],
            "val_activation_3_loss": [
                4.67251407455108,
                4.671992867647527,
                4.670991996963899,
                4.668754476344657,
                4.6626425840572745
            ],
            "val_loss": [
                12.550792357725705,
                12.549835812830494,
                12.548062947565663,
                12.544295458134286,
                12.53457817047058
            ]
        },
        "novelty": {
            "behavior": null
        },
        "num_epochs_trained": 5,
        "regression": {
            "features": null
        },
        "task_fitness": [
            0.10821643219756817
        ],
        "total_num_epochs_trained": 5,
        "train_seed": 292144,
        "training_time": 4.077490568161011,
        "weights_l2norm": null
    }
}