{
    "id": "9",
    "identity": {
        "error": null,
        "id": "9"
    },
    "interpretation": {
        "global_hyperparameters": {
            "id": "9",
            "learning_rate": 0.004807212458976666
        },
        "model": {
            "backend": "tensorflow",
            "class_name": "Model",
            "config": {
                "input_layers": [
                    [
                        "input_task_00_term_00",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                100,
                                168
                            ],
                            "dtype": "float32",
                            "name": "input_task_00_term_00",
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_00_term_00"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "final_maxpool_task_00_node_02",
                            "padding": "valid",
                            "pool_size": [
                                16
                            ],
                            "strides": [
                                16
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "final_maxpool_task_00_node_02"
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "data_format": "channels_last",
                            "name": "flattendec_task_00_term_00",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "final_maxpool_task_00_node_02",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "flattendec_task_00_term_00"
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "softmax",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "densedec_task_00_term_00",
                            "trainable": true,
                            "units": 339,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "flattendec_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "densedec_task_00_term_00"
                    }
                ],
                "name": "model_1",
                "output_layers": [
                    [
                        "densedec_task_00_term_00",
                        0,
                        0
                    ]
                ]
            },
            "keras_version": "2.2.4"
        }
    },
    "metrics": {
        "alt_objective": null,
        "avg_gpu_batch_time": [],
        "execution": {
            "client_elapsed_time": 5.704815149307251,
            "eval_error": null,
            "queue_wait_time": 6.740208864212036,
            "return_timestamp": 1568719997.425816
        },
        "fitness": 0.10487641886799891,
        "loss_history": {
            "activation_1_acc": [
                0.19304826202080172
            ],
            "activation_1_loss": [
                2.4754444273390392
            ],
            "activation_2_acc": [
                0.0222555638835203
            ],
            "activation_2_loss": [
                5.393273963246175
            ],
            "activation_3_acc": [
                0.113528382080619
            ],
            "activation_3_loss": [
                4.626173411705817
            ],
            "loss": [
                12.494891758351423
            ],
            "val_activation_1_acc": [
                0.18837675192432557
            ],
            "val_activation_1_loss": [
                2.484591076034821
            ],
            "val_activation_2_acc": [
                0.0040080159406116105
            ],
            "val_activation_2_loss": [
                5.393628120422363
            ],
            "val_activation_3_acc": [
                0.12224448873905953
            ],
            "val_activation_3_loss": [
                4.566702375431099
            ],
            "val_loss": [
                12.444921571888283
            ]
        },
        "novelty": {
            "behavior": null
        },
        "num_epochs_trained": 1,
        "regression": {
            "features": null
        },
        "task_fitness": [
            0.10487641886799891
        ],
        "total_num_epochs_trained": 1,
        "train_seed": 810441,
        "training_time": 2.0185158252716064,
        "weights_l2norm": null
    }
}