{
    "id": "284",
    "identity": {
        "error": null,
        "id": "284"
    },
    "interpretation": {
        "global_hyperparameters": {
            "id": "284",
            "learning_rate": 0.0001681794038518068
        },
        "model": {
            "backend": "tensorflow",
            "class_name": "Model",
            "config": {
                "input_layers": [
                    [
                        "input_task_00_term_00",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                100,
                                149
                            ],
                            "dtype": "float32",
                            "name": "input_task_00_term_00",
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_00_term_00"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_1",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            100,
                                            149
                                        ],
                                        "dtype": "float32",
                                        "name": "input_1",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_1"
                                },
                                {
                                    "class_name": "LSTM",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.08902641224776064,
                                        "go_backwards": 0,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_3_LSTM_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.25409141723861167,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
                                        "return_sequences": true,
                                        "return_state": false,
                                        "stateful": false,
                                        "trainable": true,
                                        "unit_forget_bias": true,
                                        "units": 183,
                                        "unroll": false,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_1",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_LSTM_0"
                                },
                                {
                                    "class_name": "GRU",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.372935488306597,
                                        "go_backwards": 0,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_4_GRU_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.05151502303980534,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
                                        "reset_after": true,
                                        "return_sequences": true,
                                        "return_state": false,
                                        "stateful": false,
                                        "trainable": true,
                                        "units": 179,
                                        "unroll": false,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_LSTM_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_4_GRU_0"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 149,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "normal",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 9.846884196917927e-09
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_4_GRU_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_1_module_247_1_3",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_1_module_247_1_3"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_2",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            50,
                                            149
                                        ],
                                        "dtype": "float32",
                                        "name": "input_2",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_2"
                                },
                                {
                                    "class_name": "LSTM",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.08902641224776064,
                                        "go_backwards": 0,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_3_LSTM_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.25409141723861167,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
                                        "return_sequences": true,
                                        "return_state": false,
                                        "stateful": false,
                                        "trainable": true,
                                        "unit_forget_bias": true,
                                        "units": 183,
                                        "unroll": false,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_2",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_LSTM_0"
                                },
                                {
                                    "class_name": "GRU",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.372935488306597,
                                        "go_backwards": 0,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_4_GRU_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.05151502303980534,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
                                        "reset_after": true,
                                        "return_sequences": true,
                                        "return_state": false,
                                        "stateful": false,
                                        "trainable": true,
                                        "units": 179,
                                        "unroll": false,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_LSTM_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_4_GRU_0"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 149,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "normal",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 9.846884196917927e-09
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_4_GRU_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_2_module_247_1_5",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_1_module_247_1_3",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_2_module_247_1_5"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "maxpool_task_00_node_02_block_00",
                            "padding": "valid",
                            "pool_size": [
                                4
                            ],
                            "strides": [
                                4
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_1_module_247_1_3",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "maxpool_task_00_node_02_block_00"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_3",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            25,
                                            149
                                        ],
                                        "dtype": "float32",
                                        "name": "input_3",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_3"
                                },
                                {
                                    "class_name": "LSTM",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.08902641224776064,
                                        "go_backwards": 0,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_3_LSTM_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.25409141723861167,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
                                        "return_sequences": true,
                                        "return_state": false,
                                        "stateful": false,
                                        "trainable": true,
                                        "unit_forget_bias": true,
                                        "units": 183,
                                        "unroll": false,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_3",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_3_LSTM_0"
                                },
                                {
                                    "class_name": "GRU",
                                    "config": {
                                        "activation": "tanh",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "dropout": 0.372935488306597,
                                        "go_backwards": 0,
                                        "implementation": 1,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "uniform",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": null,
                                        "name": "layer_4_GRU_0",
                                        "recurrent_activation": "hard_sigmoid",
                                        "recurrent_constraint": null,
                                        "recurrent_dropout": 0.05151502303980534,
                                        "recurrent_initializer": {
                                            "class_name": "Orthogonal",
                                            "config": {
                                                "gain": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "recurrent_regularizer": null,
                                        "reset_after": true,
                                        "return_sequences": true,
                                        "return_state": false,
                                        "stateful": false,
                                        "trainable": true,
                                        "units": 179,
                                        "unroll": false,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_3_LSTM_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "layer_4_GRU_0"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 149,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "normal",
                                                "mode": "fan_avg",
                                                "scale": 1.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 9.846884196917927e-09
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "layer_4_GRU_0",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_3_module_247_1_4",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_2_module_247_1_5",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_3_module_247_1_4"
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "add_softmod_task_00_node_02",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "maxpool_task_00_node_02_block_00",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "model_3_module_247_1_4",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "add_softmod_task_00_node_02"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "final_maxpool_task_00_node_02",
                            "padding": "valid",
                            "pool_size": [
                                2
                            ],
                            "strides": [
                                2
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "add_softmod_task_00_node_02",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "final_maxpool_task_00_node_02"
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "data_format": "channels_last",
                            "name": "flattendec_task_00_term_00",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "final_maxpool_task_00_node_02",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "flattendec_task_00_term_00"
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "softmax",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "densedec_task_00_term_00",
                            "trainable": true,
                            "units": 339,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "flattendec_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "densedec_task_00_term_00"
                    }
                ],
                "name": "model_1",
                "output_layers": [
                    [
                        "densedec_task_00_term_00",
                        0,
                        0
                    ]
                ]
            },
            "keras_version": "2.2.4"
        }
    },
    "metrics": {
        "alt_objective": null,
        "avg_gpu_batch_time": [],
        "execution": {
            "client_elapsed_time": 279.39090394973755,
            "eval_error": null,
            "queue_wait_time": 1034.228460073471,
            "return_timestamp": 1568755643.9972184
        },
        "fitness": 0.10554442157049376,
        "loss_history": {
            "activation_1_acc": [
                0.17154288565435835,
                0.19554888716963834,
                0.1955488871621859,
                0.19554888714728103,
                0.19554888716963834
            ],
            "activation_1_loss": [
                2.484437111766078,
                2.481391023355414,
                2.4848888740148447,
                2.484891715184484,
                2.4848916015496223
            ],
            "activation_2_acc": [
                0.005751437859464866,
                0.010252563133332752,
                0.006751687921980495,
                0.0067516879145280515,
                0.0067516879145280515
            ],
            "activation_2_loss": [
                5.3935523073683385,
                5.393524582608398,
                5.3936285972595215,
                5.3936285972595215,
                5.3936285972595215
            ],
            "activation_3_acc": [
                0.09727431857219247,
                0.12678169537168885,
                0.1267816953791413,
                0.12678169537168885,
                0.12678169540895107
            ],
            "activation_3_loss": [
                4.67221780585241,
                4.575464339994377,
                4.561995687053096,
                4.561993195790594,
                4.561992557861412
            ],
            "loss": [
                12.550212874416113,
                12.45038576142792,
                12.440518891701075,
                12.440519297114012,
                12.440518526352474
            ],
            "val_activation_1_acc": [
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557
            ],
            "val_activation_1_loss": [
                2.478325479255172,
                2.484892345382599,
                2.4848993808807496,
                2.4848993808807496,
                2.484898610678847
            ],
            "val_activation_2_acc": [
                0.022044088362990495,
                0.006012024048096192,
                0.006012024048096192,
                0.006012024048096192,
                0.006012024048096192
            ],
            "val_activation_2_loss": [
                5.393053526868801,
                5.3936285972595215,
                5.3936285972595215,
                5.3936285972595215,
                5.3936285972595215
            ],
            "val_activation_3_acc": [
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953
            ],
            "val_activation_3_loss": [
                4.660572278475714,
                4.566528181752604,
                4.566522177808987,
                4.566522177808987,
                4.5665225447538145
            ],
            "val_loss": [
