{
    "id": "286",
    "identity": {
        "error": null,
        "id": "286"
    },
    "interpretation": {
        "global_hyperparameters": {
            "id": "286",
            "learning_rate": 0.00010000000000000009
        },
        "model": {
            "backend": "tensorflow",
            "class_name": "Model",
            "config": {
                "input_layers": [
                    [
                        "input_task_00_term_00",
                        0,
                        0
                    ]
                ],
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                100,
                                118
                            ],
                            "dtype": "float32",
                            "name": "input_task_00_term_00",
                            "sparse": false
                        },
                        "inbound_nodes": [],
                        "name": "input_task_00_term_00"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "maxpool_task_00_node_04_block_00",
                            "padding": "valid",
                            "pool_size": [
                                2
                            ],
                            "strides": [
                                2
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "maxpool_task_00_node_04_block_00"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_1",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            100,
                                            118
                                        ],
                                        "dtype": "float32",
                                        "name": "input_1",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_1"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 118,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "normal",
                                                "mode": "fan_in",
                                                "scale": 2.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 3.297000006341477e-08
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_1",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_1_module_267_1_5",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_1_module_267_1_5"
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "add_softmod_task_00_node_04",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "maxpool_task_00_node_04_block_00",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "model_1_module_267_1_5",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "add_softmod_task_00_node_04"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_2",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            50,
                                            118
                                        ],
                                        "dtype": "float32",
                                        "name": "input_2",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_2"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 118,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "normal",
                                                "mode": "fan_in",
                                                "scale": 2.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 3.297000006341477e-08
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_2",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_2_module_267_1_4",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "add_softmod_task_00_node_04",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_2_module_267_1_4"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "maxpool_task_00_node_03_block_01",
                            "padding": "valid",
                            "pool_size": [
                                2
                            ],
                            "strides": [
                                2
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_1_module_267_1_5",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "maxpool_task_00_node_03_block_01"
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "add_softmod_task_00_node_03",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_2_module_267_1_4",
                                    1,
                                    0,
                                    {}
                                ],
                                [
                                    "maxpool_task_00_node_03_block_01",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "add_softmod_task_00_node_03"
                    },
                    {
                        "class_name": "Model",
                        "config": {
                            "input_layers": [
                                [
                                    "input_3",
                                    0,
                                    0
                                ]
                            ],
                            "layers": [
                                {
                                    "class_name": "InputLayer",
                                    "config": {
                                        "batch_input_shape": [
                                            null,
                                            25,
                                            118
                                        ],
                                        "dtype": "float32",
                                        "name": "input_3",
                                        "sparse": false
                                    },
                                    "inbound_nodes": [],
                                    "name": "input_3"
                                },
                                {
                                    "class_name": "Conv1D",
                                    "config": {
                                        "activation": "linear",
                                        "activity_regularizer": null,
                                        "bias_constraint": null,
                                        "bias_initializer": {
                                            "class_name": "Zeros",
                                            "config": {}
                                        },
                                        "bias_regularizer": null,
                                        "data_format": "channels_last",
                                        "dilation_rate": [
                                            1
                                        ],
                                        "filters": 118,
                                        "kernel_constraint": null,
                                        "kernel_initializer": {
                                            "class_name": "VarianceScaling",
                                            "config": {
                                                "distribution": "normal",
                                                "mode": "fan_in",
                                                "scale": 2.0,
                                                "seed": null
                                            }
                                        },
                                        "kernel_regularizer": {
                                            "class_name": "L1L2",
                                            "config": {
                                                "l1": 0.0,
                                                "l2": 3.297000006341477e-08
                                            }
                                        },
                                        "kernel_size": [
                                            1
                                        ],
                                        "name": "Conv1D",
                                        "padding": "same",
                                        "strides": [
                                            1
                                        ],
                                        "trainable": true,
                                        "use_bias": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "input_3",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "Conv1D"
                                },
                                {
                                    "class_name": "MaxPooling1D",
                                    "config": {
                                        "data_format": "channels_last",
                                        "name": "MaxPooling1D",
                                        "padding": "valid",
                                        "pool_size": [
                                            2
                                        ],
                                        "strides": [
                                            2
                                        ],
                                        "trainable": true
                                    },
                                    "inbound_nodes": [
                                        [
                                            [
                                                "Conv1D",
                                                0,
                                                0,
                                                {}
                                            ]
                                        ]
                                    ],
                                    "name": "MaxPooling1D"
                                }
                            ],
                            "name": "model_3_module_267_1_3",
                            "output_layers": [
                                [
                                    "MaxPooling1D",
                                    0,
                                    0
                                ]
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "add_softmod_task_00_node_03",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "model_3_module_267_1_3"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "maxpool_task_00_node_02_block_01",
                            "padding": "valid",
                            "pool_size": [
                                2
                            ],
                            "strides": [
                                2
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_2_module_267_1_4",
                                    1,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "maxpool_task_00_node_02_block_01"
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "add_softmod_task_00_node_02",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "model_3_module_267_1_3",
                                    1,
                                    0,
                                    {}
                                ],
                                [
                                    "maxpool_task_00_node_02_block_01",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "add_softmod_task_00_node_02"
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "data_format": "channels_last",
                            "name": "final_maxpool_task_00_node_02",
                            "padding": "valid",
                            "pool_size": [
                                2
                            ],
                            "strides": [
                                2
                            ],
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "add_softmod_task_00_node_02",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "final_maxpool_task_00_node_02"
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "data_format": "channels_last",
                            "name": "flattendec_task_00_term_00",
                            "trainable": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "final_maxpool_task_00_node_02",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "flattendec_task_00_term_00"
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "softmax",
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "distribution": "uniform",
                                    "mode": "fan_avg",
                                    "scale": 1.0,
                                    "seed": null
                                }
                            },
                            "kernel_regularizer": null,
                            "name": "densedec_task_00_term_00",
                            "trainable": true,
                            "units": 339,
                            "use_bias": true
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "flattendec_task_00_term_00",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ],
                        "name": "densedec_task_00_term_00"
                    }
                ],
                "name": "model_1",
                "output_layers": [
                    [
                        "densedec_task_00_term_00",
                        0,
                        0
                    ]
                ]
            },
            "keras_version": "2.2.4"
        }
    },
    "metrics": {
        "alt_objective": null,
        "avg_gpu_batch_time": [],
        "execution": {
            "client_elapsed_time": 14.962172508239746,
            "eval_error": null,
            "queue_wait_time": 1556.3609957695007,
            "return_timestamp": 1568755887.5366142
        },
        "fitness": 0.10955243758264988,
        "loss_history": {
            "activation_1_acc": [
                0.11627906970782231,
                0.14028507125291206,
                0.1607901975046727,
                0.1955488871770908,
                0.19554888720690056
            ],
            "activation_1_loss": [
                2.4848256314447683,
                2.4835590473798907,
                2.481908676057316,
                2.4846159994497867,
                2.484730554837291
            ],
            "activation_2_acc": [
                0.008502125531382845,
                0.009502375593898474,
                0.013753438352137454,
                0.013003250805250732,
                0.010002500625156289
            ],
            "activation_2_loss": [
                5.393483625766366,
                5.392745907409813,
                5.39304497910309,
                5.393615002929047,
                5.3936227733834325
            ],
            "activation_3_acc": [
                0.05526381592417872,
                0.12678169536423642,
                0.12678169539404618,
                0.12678169538659376,
                0.12678169539404618
            ],
            "activation_3_loss": [
                4.672296468005475,
                4.666964983218728,
                4.597250879988368,
                4.563508196633051,
                4.562583217325137
            ],
            "loss": [
                12.550628535238973,
                12.543292774621115,
                12.47222737176146,
                12.441762066149778,
                12.440959473972649
            ],
            "val_activation_1_acc": [
                0.14428857563134426,
                0.14428857563134426,
                0.18837675192432557,
                0.18837675192432557,
                0.18837675192432557
            ],
            "val_activation_1_loss": [
                2.484490037203313,
                2.4814310250635856,
                2.4843647260226325,
                2.484694115384547,
                2.4847422090465416
            ],
            "val_activation_2_acc": [
                0.01202404791328735,
                0.014028056052500355,
                0.018036071961383543,
                0.018036072084564484,
                0.018036072084564484
            ],
            "val_activation_2_loss": [
                5.393248536065967,
                5.39210547999533,
                5.393609529506707,
                5.393624257945823,
                5.393626018134291
            ],
            "val_activation_3_acc": [
                0.12424849730753947,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953,
                0.12224448873905953
            ],
            "val_activation_3_loss": [
                4.671412067566224,
                4.65232439748271,
                4.567946507601079,
                4.566844161383375,
                4.566727231165212
            ],
            "val_loss": [
                12.549173529019098,
                12.525883858093996,
                12.445943767417647,
                12.44518519690137,
                12.44511821800339
            ]
        },
        "novelty": {
            "behavior": null
        },
        "num_epochs_trained": 5,
        "regression": {
            "features": null
        },
        "task_fitness": [
            0.10955243758264988
        ],
        "total_num_epochs_trained": 5,
        "train_seed": 645073,
        "training_time": 11.125916957855225,
        "weights_l2norm": null
    }
}